#### Ordinal Encoding

In [16]:
import datetime

In [17]:
today_date = datetime.datetime.today()
today_date

datetime.datetime(2020, 9, 21, 17, 24, 4, 27153)

In [18]:
today_date-datetime.timedelta(2)

datetime.datetime(2020, 9, 19, 17, 24, 4, 27153)

In [19]:
## We can get the list by using list comprehension
days = [today_date-datetime.timedelta(x) for x in range(0,15)]

In [20]:
import pandas as pd

In [21]:
data=pd.DataFrame(days)
data.columns=["Day"]

In [22]:
data.head()

                         Day
0 2020-09-21 17:24:04.027153
1 2020-09-20 17:24:04.027153
2 2020-09-19 17:24:04.027153
3 2020-09-18 17:24:04.027153
4 2020-09-17 17:24:04.027153

In [30]:
data['weekday']=data['Day'].dt.day_name()
data.head()

                         Day   weekday
0 2020-09-21 17:24:04.027153    Monday
1 2020-09-20 17:24:04.027153    Sunday
2 2020-09-19 17:24:04.027153  Saturday
3 2020-09-18 17:24:04.027153    Friday
4 2020-09-17 17:24:04.027153  Thursday

In [31]:
dic = {'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7
}

In [32]:
data['weekday_ordinal']=data['weekday'].map(dic)
data.head()

                         Day   weekday  weekday_ordinal
0 2020-09-21 17:24:04.027153    Monday                1
1 2020-09-20 17:24:04.027153    Sunday                7
2 2020-09-19 17:24:04.027153  Saturday                6
3 2020-09-18 17:24:04.027153    Friday                5
4 2020-09-17 17:24:04.027153  Thursday                4

### Count Or Frequency Encoding

In [33]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [34]:
columns=[1,3,5,6,7,8,9,13] ## only columns with categorical feature

In [35]:
train_set=train_set[columns]

In [36]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [37]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [40]:
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()))

Employment : 9
Degree : 16
Status : 7
Designation : 15
family_job : 6
Race : 5
Sex : 2
Country : 42

In [42]:
#lets do count or frequency encoding for country

train_set['Country'].value_counts()

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 Greece                           29
 France                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Cambodia                         19
 Trinadad&Tobago                  19
 Laos                             18
 Thailand                         18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Hungary                          13
 Honduras                         13
 Scotland                         12
 Holand-Netherlands                1
Name: Country, dtype: int64

In [43]:
#now we will replace the country name with the frequency it is occuring 
#like USA with 29170

country_map=train_set['Country'].value_counts().to_dict()

In [44]:
train_set['Country']=train_set['Country'].map(country_map)
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Advantage:
   1. Easy to Use
   2. Doesn't increase the feature
   
#### Disadvantage:

   1. If two countries have same frequency then this encoding 
      will provide same frequency for two countries and then our model
      won't be able to predict different countries.
      In a nutshell we will have same weight for two different labels

#### Target Guided Ordinal Encoding

In [45]:
import pandas as pd

In [47]:
df = pd.read_csv("train.csv",usecols=['Cabin','Survived'])
9df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [50]:
df['Cabin'].fillna(value = 'Missing',inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [51]:
df['Cabin']=df['Cabin'].astype(str).str[0]  ### This is used to take out the first letter from the Cabin column 
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [53]:
df.groupby(df['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [54]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [56]:
ordinal_labels1 = {k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels1

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [58]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels1)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

#### Mean Encoding

In [59]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [60]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [61]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854